function getArrayLength(array) {
    // Перевіряємо чи аргумент є масивом і чи він переданий
    if (!Array.isArray(array)) {
        return "Помилка: очікувався масив як аргумент";
    }
    
// проходимо по кожному елементу і ставимо плюс, якщо він є
    let count = 0;
    for (let index in array) { 
        count++;
    }


    return count;
}

console.log('Варіант 1');
console.log('Завдання 3');
console.log('Текст задачі: Створіть функцію, яка розраховує довжину масиву і повертає її у вигляді числа. Масив в функцію передається як аргумент. Якщо аргумент не заданий - виводиться повідомлення про помилку.');
console.log('Введені дані: 1, 2, 3, 4');
console.log('Результат виконання скрипта: ' + getArrayLength([1, 2, 3, 4]));
